# --------------Biostatistics with R--------------------
# author: Guoqing Liu
# email: gqliu1010@163.com
# affiliation: Inner Mongolia University of Science and Technology
# Acknowlegments: 
# 1．生物统计学，李春喜，科学出版社，2018年（第五版）
# 2. 实用生物统计学,李松岗 曲红， 高等教育出版社，2012年，第二版
# 3. 统计学习导论基于R 应用，力雷斯•詹姆斯等著，王星等译
#  ------------------------------------------------------




##例7.1：有人研究黏虫孵化历期平均温度与历期天数之间的关系，试验资料如下。试建立直线回归方程。
#平均温度：11.8,14.7,15.6,16.8,17.1,18.8,19.5,20.4
#历期天数：30.1,17.3,16.7,13.6,11.9,10.7,8.3,6.7


x=c(11.8,14.7,15.6,16.8,17.1,18.8,19.5,20.4)
y=c(30.1,17.3,16.7,13.6,11.9,10.7,8.3,6.7)
model=lm(y~x)
#model里存放着计算结果，包括截距，回归系数等
intercept=model$coefficients[1]
slope=model$coefficients[2]
summary(model)

#得到intercept=57, slope=-2.53
#summary(model)后能看到回归系数slope的t检验结果：统计量t=-9.48, pvalue=7.85e-05
#推断：pvalue=7.85e-05，pvalue<0.05, 因此历期平均温度与历期天数之间存在显著的线性回归关系。

#summary(model)也能看到回归系数slope的F检验结果：F-statistic: 89.87 on 1 and 6 DF,  p-value: 7.848e-05
#推断：pvalue=7.848e-05，pvalue<0.05, 因此历期平均温度与历期天数之间存在显著的线性回归关系。



##例7.8：有人研究黏虫孵化历期平均温度与历期天数之间的关系，试验资料如下。试分析历期温度与历期天数之间的相关性。
#平均温度：11.8,14.7,15.6,16.8,17.1,18.8,19.5,20.4
#历期天数：30.1,17.3,16.7,13.6,11.9,10.7,8.3,6.7

x=c(11.8,14.7,15.6,16.8,17.1,18.8,19.5,20.4)
y=c(30.1,17.3,16.7,13.6,11.9,10.7,8.3,6.7)
cor.test(x,y)
#得到结果：t = -9.4798, df = 6, p-value = 7.848e-05, corr.coefficient=-0.9682
#推断：p-value<0.05, 相关系数r=-0.9682, 因此历期平均温度与历期天数之间存在显著的负相关性。


##习题7.4：下面是某地区4月下旬平均气温与5月上旬50株棉苗蚜虫头数的资料。
#(1)建立直线回归方程
#(2)对回归系数作假设检验
#(3)该地区4月下旬平均气温为18摄氏度时，5月上旬50株棉苗蚜虫预期为多少头？

#4月下旬平均气温：19.3,26.6,18.1,17.4,17.5,16.9,16.9,19.1,17.9,17.5,18.1,19
#5月上旬蚜虫头数：86,197,8,29,28,29,23,12,14,64,50,112

#(1)建立直线回归方程
x=c(19.3,26.6,18.1,17.4,17.5,16.9,16.9,19.1,17.9,17.5,18.1,19)
y=c(86,197,8,29,28,29,23,12,14,64,50,112)

model=lm(y~x)
#model里存放着计算结果，包括截距，回归系数等
intercept=model$coefficients[1]
slope=model$coefficients[2]
##计算结果：intercept=-283.7,  slope=18.1

#(2)对回归系数作假设检验
summary(model)
#回归系数的t检验结果：t=5.339, pvalue=0.000328
#回归系数的F检验结果：F-statistic: 28.51 on 1 and 10 DF,  p-value: 0.0003285

#(3)该地区4月下旬平均气温为18摄氏度时，5月上旬50株棉苗蚜虫预期为多少头？
newdata=data.frame(x=c(18))
predicted<-predict(model,newdata=newdata,interval = "prediction")
y.predicted=predicted[1]
confi.Interval=predicted[2:3]
##计算结果：预期蚜虫41.8头; 95%置信区间为[-26.6, 110.2]

